#=========================================================================================
#file to upcase,also you can revese to create the to lowcase function
cat $1 | tr ‘[a-z]’ ‘[A-Z]’
#=========================================================================================
#ssh login to remote server
ssh  zhaoyong@9.123.147.114
#=========================================================================================
#remote desktop to a windows machine
rdesktop -u Administrator -p welcome1 -g1908x1148 9.123.147.103
#=========================================================================================
#vnc viewer to a remote machine
vncviewer -geometry 1916x1148 9.123.147.114:1
#=========================================================================================
#mount a remote samba share floder
sudo mount //9.123.147.72/public /TeamServer -o username=zy,password=zy,uid=zhaoyong	
#=========================================================================================
#count lines
#sample: cat mpxdata-20110401-110049.mlg|grep "MAD_GLB_isChineseChar:entering" | wc -l
cat $1|grep $2 | wc -l
#=========================================================================================
#count the the specil file with certain name's number
#sample: ls  -R |grep .cpp|wc -l
ls -R |grep $1|wc -l
#=========================================================================================
#count all line numbers of current folder's c files
ls *.c|xargs cat|wc -l  
#=========================================================================================
#download a whole folder in the web
#sample:
wget -r -np $1 
#=========================================================================================
#rsync the local folder to the remote folder
# --delete 本地没有的，也要在服务器端删除
# --links 保留软链接，但是不会把软链接的内容拷贝过去
/usr/bin/rsync -vzrtopg --progress --delete /home/zhaoyong/Doc  zhaoyong@9.123.147.114::zyshare
#=========================================================================================
#安装 32 位软件包
sudo getlibs -32 libgtk-1.2.so.0 libgmodule-1.2.so.0 
#=========================================================================================
#强行安装32位下载的 deb包
sudo dpkg -i --force-all gcvs_1.0.0-1_i386.deb
#=========================================================================================



#=========================================================================================
#第一个命令：查找并列出当前目录中过去一天修改的所有文件。
find ./ -type f -mtime -1 -exec ls -al {} \;
#　　你显然可以修改该命令，以便查找其他地方、不同时间（把-1改成不同的时间）的文件。
#=========================================================================================
#第二个命令：查找文件，然后执行一个基于Perl的寻找-替换功能。
#　　在这种情况下，我们查找所有扩展名为.txt的文件，并在这些文件中查找单词“goldfish”，把这个单词替换成“tiger”。
find . -name '*.txt' -type f -exec perl -pi -e 's/goldfish/tiger/g' {} \;
#=========================================================================================
#最后一个查找命令：我经常用它从我的路径中递归删除.svn（和其他的）目录。
find . -name ".svn" -exec rm -rf {} \;
#=========================================================================================

# 处理作业 首先，使用 Ctrl + z 快捷键可以让正在执行的命令挂起。如果要让该进程在后台执行，那么可以执行 bg 命令。而 fg 命令则可以让该进程重新回到前台来。使用 jobs 命令能够查看到哪些进程在后台执行。 你也可以在 fg 或 bg 命令中使用作业 id，如： fg %3 又如： bg %7
# 使用置换

    # 命令置换 先看例子： 
	du -h -a -c $(find . -name *.conf 2>&-) #注意 $() 中的部分，这将告诉 Bash 运行 find 命令，然后把返回的结果作为 du 的参数。
    # 进程置换 仍然先看例子：
	 diff <(ps axo comm) <(ssh user@host ps axo comm) #该命令将比较本地系统和远程系统中正在运行的进程。请注意 <() 中的部分。
    # xargs 看例： 
	find . -name *.conf -print0 | xargs -0 grep -l -Z mem_limit | xargs -0 -i cp {} {}.bak #该命令将备份当前目录中的所有 .conf 文件。
#=========================================================================================
# 将标准输出保存为文件 你可以将命令的标准输出内容保存到一个文件中，举例如下： 
ps aux > filename 
#注意其中的“>”符号。 你也可以将这些输出内容追加到一个已存在的文件中： 
ps aux >> filename 
#=========================================================================================

